#  পেটিয়া প্রোগ্রামিং পাঠে অংশ নিতে শুরু করেছিল।
#  প্রথম পাঠে তার কাজ ছিল একটি সাধারণ প্রোগ্রাম লেখা।
#  প্রোগ্রামটির নিম্নলিখিতগুলি করার কথা ছিল: প্রদত্ত স্ট্রিংটিত,
#  যদি বড় হাতের এবং ছোট হাতের ল্যাটিন অক্ষর থাকে, এটি:

#    মুছে দেয় সমস্ত স্বরবর্ণor
#    একটি অক্ষর সন্নিবেশ করান "." প্রতিটি ব্যঞ্জনবর্ণের আগেor
#    অনুরূপ ছোট হাতের ব্যঞ্জনবর্ণের সাথে সমস্ত বড় হাতের ব্যঞ্জনবর্ণ প্রতিস্থাপন করে।

# স্বরবর্ণগুলি হল "A"or "O"or "Y"or "E"or "U"or "I"or এবং বাকিগুলি ব্যঞ্জনবর্ণ। প্রোগ্রামের ইনপুট ঠিক একটি স্ট্রিং, এটি একটি একক স্ট্রিং হিসাবে আউটপুট ফেরত দেওয়া উচিত, যার ফলে প্রোগ্রামের প্রাথমিক স্ট্রিং প্রক্রিয়াকরণের পরে।

# পেটিয়াকে এই সহজ কাজটি মোকাবেলা করতে সহায়তা করুন।

#ইনপুট

# প্রথম লাইন পেটিয়ার প্রোগ্রামের ইনপুট স্ট্রিং প্রতিনিধিত্ব করে। 
# এই স্ট্রিংটি শুধুমাত্র বড় হাতের এবং ছোট হাতের ল্যাটিন অক্ষর নিয়ে গঠিত এবং এর দৈর্ঘ্য 1 থেকে 100 পর্যন্ত, অন্তর্ভুক্ত।

#আউটপুট

#ফলস্বরূপ স্ট্রিং প্রিন্ট করুন। এটা নিশ্চিত যে এই স্ট্রিংটি খালি নয়।

string = str(input()).lower()
s='';

for i in range(len(string)):
    #print(string[i])
    if "a"==string[i] or "o"==string[i] or"y"==string[i] or "e"==string[i] or "u"==string[i] or "i"==string[i]:
    #if "a" or "o" or "y" or "e" or "u" or "i"  in string[i]:
        s=s+'.'
    else:
        s=s+string[i]
        #print(list_str[i])
    

print(s)