# জেনিয়া প্রাথমিক বিদ্যালয়ের তৃতীয় বর্ষের ছাত্র। তিনি এখন যোগ অপারেশন শিখছেন.
# শিক্ষক একাধিক সংখ্যার যোগফল লিখে রেখেছেন। ছাত্রদের যোগফল গণনা করা উচিত। 
# গণনা সহজ করার জন্য, যোগফলটিতে শুধুমাত্র 1, 2 এবং 3 নম্বর রয়েছে। তবুও, জেনিয়ার জন্য এটি যথেষ্ট নয়।
# তিনি শুধুমাত্র গণনা শুরু করেছেন,
# তাই তিনি একটি যোগফল গণনা করতে পারেন শুধুমাত্র যদি সমনগুলি অ-হ্রাসমান ক্রমে অনুসরণ করে। 
# উদাহরণস্বরূপ, তিনি যোগফল 1+3+2+1 গণনা করতে পারেন না কিন্তু তিনি 1+1+2 এবং 3+3 যোগফল গণনা করতে পারেন।
# আপনি বোর্ডে লেখা সমষ্টি পেয়েছেন।
# সমনগুলিকে পুনর্বিন্যাস করুন এবং যোগফলকে এমনভাবে প্রিন্ট করুন যাতে Xenia যোগফল গণনা করতে পারে।

# ইনপুট

# প্রথম লাইনে একটি অ-খালি স্ট্রিং s রয়েছে — Xenia কে গণনা করতে হবে। স্ট্রিং s-এ কোনো স্পেস নেই। 
# এটি শুধুমাত্র "+" সংখ্যা এবং অক্ষর ধারণ করে। এছাড়াও, স্ট্রিং s হল 1, 2 এবং 3 সংখ্যার সঠিক যোগফল। 
# স্ট্রিং s সর্বাধিক 100 অক্ষর দীর্ঘ।

# আউটপুট

# Xenia গণনা করতে পারে এমন নতুন যোগফল প্রিন্ট করুন।

sum_str = str(input())
s_list=list(sum_str)

#print(sorted(s_list))
# for s in s_list:
#     print(s)
#     if s is "+":


#for s in sum_str:

